import Card from "./Card";
import "../assets/css/blueHeader.css";

const BlueHeader = () => {
  return (
    <div className="blue-header">
      <h1>
        بلیط اتوبوس
        <br /> با ۴ مرحله آمادست!
      </h1>
      <div className="separator-line-bold"></div>
      <div className="texts-container">
        <Card iconClass="smile" title="پیامک شماره‌ی بلیط اتوبوس را دریافت کنید">
          به همین راحتی خرید اینترنتی بلیط اتوبوس شما تمام شد. ما بستری را فراهم کرده ایم که در آن بلیط اتوبوس برای صادر
          شدن نیازی به چاپ ندارد. کافی است شماره پیامک شده بلیط اتوبوس را همراه خود داشته باشید.
        </Card>
        <Card iconClass="sit" title="صندلی خود را تعیین کنید">
          رزرو بلیط اتوبوس همراه با انتخاب صندلی یکی از ویژگیهای خرید اینترنتی بلیط اتوبوس میباشد. با مشاهده چیدمان
          صندلی های اتوبوس به راحتی صندلی دلخواهتان را انتخاب کنید و از سفر خود لذت ببرید.
        </Card>
        <Card iconClass="bus" title="مناسب‌ترین بلیط اتوبوس را انتخاب کنید">
          ما با تمامیه شرکت های مسافربری همکاری می‌کنیم. بلیط اتوبوس شرکت ها به تفکیک قیمت، ساعت حرکت، پایانه‌ها و نوع
          اتوبوس پیش روی شما است تا بلیط اتوبوس مناسب خود را انتخاب کنید.
        </Card>
        <Card iconClass="direction" title="مبدا و مقصد را وارد کنید">
          خرید بلیط اتوبوس به ساده ترین شکل، بدون نیاز به ثبت نام، در سامانه سفر724 برای شما فراهم شده است. با وارد کردن
          مبداء و مقصد بهترین، معتبرترین و ارزانترین بلیط های اتوبوس را مشاهده خواهید کرد.
        </Card>
      </div>
    </div>
  );
};

export default BlueHeader;
