import React from 'react'
import '../assets/css/twoColumns.css'
import CardWithIcon from './CardWithIcon'
import ExpandableCard from './ExpandableCard'


const TwoColumns = () => {
    return (
        <div className="two-columns">
            <div className='grid-three-rows'>
                <CardWithIcon title='چاپ و نمایش برگه اطلاعات بلیط اتوبوس' icon="paper">در این بخش با وارد کردن شماره‌ی بلیطی که قبلا بهتان پیامک شده، امکان چاپ و یا مشاهده‌ی بلیط در هر لحظه وجود دارد.</CardWithIcon>
                <CardWithIcon title='رهگیری شماره‌ی بلیط اتوبوس' icon="magnifier">شماره‌ی بلیت‌ به دست تان نرسیده یا آن را فراموش کرده‌اید؟ نگران نباشید! این بخش برای بازیابی و پیگیری شماره‌ی بلیت شما طراحی شده.</CardWithIcon>
                <CardWithIcon title='استرداد بلیط اتوبوس' icon="circle-dollar">قصد کنسل کردن بلیت تان را دارید؟ برنامه سفرتان به هم خورده؟ کافی است مراحل استرداد بلیت را انجام دهید. فرآیند ساده‌ای است، باور کنید!</CardWithIcon>
            </div>
            <div className='bus-common-questions' style={{ overflowY: 'scroll' }}>
                <h1>بلیط اتوبوس و پرسش های متداول</h1>
                <div className='seperator-line-bcq'></div>
                <ExpandableCard title="خرید بلیط اتوبوس از سفر ۷۲۴ هزینه اضافی دارد؟">خرید بلیط توبوس از سفر ۷۲۴ هیچ‌ هزینه اضافی برای مسافر ندارد و قیمت در خرید اینترنتی با خرید حضوری برابر است. تهیه بلیط اتوبوس به صورت اینترنتی این حسن را دارد که مسافر میتواند بلیط های تخفیف دار را در مسیر های متفاوت مشاهده کرده و خرید بلیط اتوبوس خود را با بهترین قیمت انجام دهد.</ExpandableCard>
                <ExpandableCard title='قیمت‌ بلیط اتوبوس توسط سامانه سفر۷۲۴ تعیین میشود؟'>سفر۷۲۴ نقشی در تعیین قیمت بلیط اتوبوس ندارد. تمامی قیمت‌ها از طرف شرکت‌های مسافربری مشخص شده و هزینه بلیط اتوبوس توسط سایت سفر 724 به مسافران عزیز نشان داده میشوند</ExpandableCard>
                <ExpandableCard title="بلیط اتوبوس VIP با معمولی چه تفاوتی دارند؟">بلیط اتوبوس vip برای اتوبوس هایی صادر میشود که تعداد صندلی کمتر با امکان تخت شو و ویژگیهای خاصی مانند شارژر، مانیتور پشت صندلی و ... را دارا باشد. مسافرت با اتوبوس های vip لذت بخش تر بوده و از لحاظ قیمت نیز خرید بلیط اتوبوس vip هزینه بیشتری دارد.</ExpandableCard>
                <ExpandableCard title='رزرو بلیط اتوبوس برای کودکان زیر 2 سال هم باید انجام شود؟'>بله، برای هرکسی که در صندلی اختصاصی خود مینشیند باید بلیط اتوبوس صادر شود و رزرو بلیط اتوبوس برای آن شخص الزامی است. رزرو اینترنتی بلیط اتوبوس نیز از ین قاعده مستثنی نیست.</ExpandableCard>
                <ExpandableCard title='حمل حیوانات خانگی با اتوبوس امکان پذیر است؟'>حمل‌ و نقل حیوانات با اتوبوس‌ بین شهری خلاف مقررات و قوانین راهداری میباشد. برای اطلاع دقیق در این خصوص می‌توانین به مطلب حمل حیوانات خانگی با اتوبوس‌های بین شهری که در سایت سفر۷۲۴ وجود دارد مراجعه فرمایید.</ExpandableCard>
                <ExpandableCard title='بلیط اتوبوس را میشود به صورت آنلاین باطل کرد؟'>اگر خرید اینترنتی بلیط اتوبوس از طریق سایت سفر ۷۲۴ انجام شده باشد، می‌توان بلیط را به صورت آنلاین کنسل کرد. برای ابطال بلیط به بخش استرداد بلیط اتوبوس مراجعه فرموده و با وارد کردن شماره ۱۲ رقمی، بلیت اتوبوس را کنسل نمایید. در صورت خرید به صورت حضوری یا رزرو بلیط اتوبوس از سایت دیگر ، نمیتوان بلیط را از سایت سفر724 کنسل کرد.</ExpandableCard>
                <ExpandableCard title="بعد از خرید اینترنتی بلیط اتوبوس چاپ بلیط لازم است؟">در خرید آنلاین بلیط اتوبوس نیازی به چاپ بلیط نیست، شماره پیامک شده بلیط اتوبوس برای سفر اتوبوسی کافی است.</ExpandableCard>
                <button className='more'>
                    <a>بیشتر...</a>
                </button>
            </div>
        </div>
    )
}

export default TwoColumns